Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT _u(0x3f)
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_CHAIN_TO
// Description : When this channel completes, it will trigger the channel
//               indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this
//               channel)_.
//
//               Note this field resets to 0, so channels 1 and above will chain
//               to channel 0 by default. Set this field to avoid this
//               behaviour.
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_BITS   _u(0x0001e000)
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_MSB    _u(16)
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_LSB    _u(13)
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_RING_SEL
// Description : Select whether RING_SIZE applies to read or write addresses.
//               If 0, read addresses are wrapped on a (1 << RING_SIZE)
//               boundary. If 1, write addresses are wrapped.
#define DMA_CH15_CTRL_TRIG_RING_SEL_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_RING_SEL_BITS   _u(0x00001000)
#define DMA_CH15_CTRL_TRIG_RING_SEL_MSB    _u(12)
#define DMA_CH15_CTRL_TRIG_RING_SEL_LSB    _u(12)
#define DMA_CH15_CTRL_TRIG_RING_SEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_RING_SIZE
// Description : Size of address wrap region. If 0, don't wrap. For values n >
//               0, only the lower n bits of the address will change. This wraps
//               the address on a (1 << n) byte boundary, facilitating access to
//               naturally-aligned ring buffers.
//
//               Ring sizes between 2 and 32768 bytes are possible. This can
//               apply to either read or write addresses, based on value of
//               RING_SEL.
//               0x0 -> RING_NONE
#define DMA_CH15_CTRL_TRIG_RING_SIZE_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_RING_SIZE_BITS   _u(0x00000f00)
#define DMA_CH15_CTRL_TRIG_RING_SIZE_MSB    _u(11)
#define DMA_CH15_CTRL_TRIG_RING_SIZE_LSB    _u(8)
#define DMA_CH15_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE _u(0x0)
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_INCR_WRITE_REV
// Description : If 1, and INCR_WRITE is 1, the write address is decremented
//               rather than incremented with each transfer.
//
//               If 1, and INCR_WRITE is 0, this otherwise-unused combination
//               causes the write address to be incremented by twice the
//               transfer size, i.e. skipping over alternate addresses.
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_BITS   _u(0x00000080)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_MSB    _u(7)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_LSB    _u(7)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_INCR_WRITE
// Description : If 1, the write address increments with each transfer. If 0,
//               each write is directed to the same, initial address.
//
//               Generally this should be disabled for memory-to-peripheral
//               transfers.
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_BITS   _u(0x00000040)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_MSB    _u(6)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_LSB    _u(6)
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_INCR_READ_REV
// Description : If 1, and INCR_READ is 1, the read address is decremented
//               rather than incremented with each transfer.
//
//               If 1, and INCR_READ is 0, this otherwise-unused combination
//               causes the read address to be incremented by twice the transfer
//               size, i.e. skipping over alternate addresses.
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_BITS   _u(0x00000020)
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_MSB    _u(5)
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_LSB    _u(5)
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_INCR_READ
// Description : If 1, the read address increments with each transfer. If 0,
//               each read is directed to the same, initial address.
//
//               Generally this should be disabled for peripheral-to-memory
//               transfers.
#define DMA_CH15_CTRL_TRIG_INCR_READ_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_INCR_READ_BITS   _u(0x00000010)
#define DMA_CH15_CTRL_TRIG_INCR_READ_MSB    _u(4)
#define DMA_CH15_CTRL_TRIG_INCR_READ_LSB    _u(4)
#define DMA_CH15_CTRL_TRIG_INCR_READ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_DATA_SIZE
// Description : Set the size of each bus transfer (byte/halfword/word).
//               READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes)
//               with each transfer.
//               0x0 -> SIZE_BYTE
//               0x1 -> SIZE_HALFWORD
//               0x2 -> SIZE_WORD
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_BITS   _u(0x0000000c)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_MSB    _u(3)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_LSB    _u(2)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE _u(0x0)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD _u(0x1)
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD _u(0x2)
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_HIGH_PRIORITY
// Description : HIGH_PRIORITY gives a channel preferential treatment in issue
//               scheduling: in each scheduling round, all high priority
//               channels are considered first, and then only a single low
//               priority channel, before returning to the high priority
//               channels.
//
//               This only affects the order in which the DMA schedules
//               channels. The DMA's bus priority is not changed. If the DMA is
//               not saturated then a low priority channel will see no loss of
//               throughput.
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_BITS   _u(0x00000002)
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_MSB    _u(1)
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_LSB    _u(1)
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_CH15_CTRL_TRIG_EN
// Description : DMA Channel Enable.
//               When 1, the channel will respond to triggering events, which
//               will cause it to become BUSY and start transferring data. When
//               0, the channel will ignore triggers, stop issuing transfers,
//               and pause the current transfer sequence (i.e. BUSY will remain
//               high if already high)
#define DMA_CH15_CTRL_TRIG_EN_RESET  _u(0x0)
#define DMA_CH15_CTRL_TRIG_EN_BITS   _u(0x00000001)
#define DMA_CH15_CTRL_TRIG_EN_MSB    _u(0)
#define DMA_CH15_CTRL_TRIG_EN_LSB    _u(0)
#define DMA_CH15_CTRL_TRIG_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL1_CTRL
// Description : Alias for channel 15 CTRL register
#define DMA_CH15_AL1_CTRL_OFFSET _u(0x000003d0)
#define DMA_CH15_AL1_CTRL_BITS   _u(0xffffffff)
#define DMA_CH15_AL1_CTRL_RESET  "-"
#define DMA_CH15_AL1_CTRL_MSB    _u(31)
#define DMA_CH15_AL1_CTRL_LSB    _u(0)
#define DMA_CH15_AL1_CTRL_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL1_READ_ADDR
// Description : Alias for channel 15 READ_ADDR register
#define DMA_CH15_AL1_READ_ADDR_OFFSET _u(0x000003d4)
#define DMA_CH15_AL1_READ_ADDR_BITS   _u(0xffffffff)
#define DMA_CH15_AL1_READ_ADDR_RESET  "-"
#define DMA_CH15_AL1_READ_ADDR_MSB    _u(31)
#define DMA_CH15_AL1_READ_ADDR_LSB    _u(0)
#define DMA_CH15_AL1_READ_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL1_WRITE_ADDR
// Description : Alias for channel 15 WRITE_ADDR register
#define DMA_CH15_AL1_WRITE_ADDR_OFFSET _u(0x000003d8)
#define DMA_CH15_AL1_WRITE_ADDR_BITS   _u(0xffffffff)
#define DMA_CH15_AL1_WRITE_ADDR_RESET  "-"
#define DMA_CH15_AL1_WRITE_ADDR_MSB    _u(31)
#define DMA_CH15_AL1_WRITE_ADDR_LSB    _u(0)
#define DMA_CH15_AL1_WRITE_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL1_TRANS_COUNT_TRIG
// Description : Alias for channel 15 TRANS_COUNT register
//               This is a trigger register (0xc). Writing a nonzero value will
//               reload the channel counter and start the channel.
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_OFFSET _u(0x000003dc)
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_BITS   _u(0xffffffff)
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_RESET  "-"
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_MSB    _u(31)
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_LSB    _u(0)
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL2_CTRL
// Description : Alias for channel 15 CTRL register
#define DMA_CH15_AL2_CTRL_OFFSET _u(0x000003e0)
#define DMA_CH15_AL2_CTRL_BITS   _u(0xffffffff)
#define DMA_CH15_AL2_CTRL_RESET  "-"
#define DMA_CH15_AL2_CTRL_MSB    _u(31)
#define DMA_CH15_AL2_CTRL_LSB    _u(0)
#define DMA_CH15_AL2_CTRL_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL2_TRANS_COUNT
// Description : Alias for channel 15 TRANS_COUNT register
#define DMA_CH15_AL2_TRANS_COUNT_OFFSET _u(0x000003e4)
#define DMA_CH15_AL2_TRANS_COUNT_BITS   _u(0xffffffff)
#define DMA_CH15_AL2_TRANS_COUNT_RESET  "-"
#define DMA_CH15_AL2_TRANS_COUNT_MSB    _u(31)
#define DMA_CH15_AL2_TRANS_COUNT_LSB    _u(0)
#define DMA_CH15_AL2_TRANS_COUNT_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL2_READ_ADDR
// Description : Alias for channel 15 READ_ADDR register
#define DMA_CH15_AL2_READ_ADDR_OFFSET _u(0x000003e8)
#define DMA_CH15_AL2_READ_ADDR_BITS   _u(0xffffffff)
#define DMA_CH15_AL2_READ_ADDR_RESET  "-"
#define DMA_CH15_AL2_READ_ADDR_MSB    _u(31)
#define DMA_CH15_AL2_READ_ADDR_LSB    _u(0)
#define DMA_CH15_AL2_READ_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL2_WRITE_ADDR_TRIG
// Description : Alias for channel 15 WRITE_ADDR register
//               This is a trigger register (0xc). Writing a nonzero value will
//               reload the channel counter and start the channel.
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_OFFSET _u(0x000003ec)
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_BITS   _u(0xffffffff)
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_RESET  "-"
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_MSB    _u(31)
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_LSB    _u(0)
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL3_CTRL
// Description : Alias for channel 15 CTRL register
#define DMA_CH15_AL3_CTRL_OFFSET _u(0x000003f0)
#define DMA_CH15_AL3_CTRL_BITS   _u(0xffffffff)
#define DMA_CH15_AL3_CTRL_RESET  "-"
#define DMA_CH15_AL3_CTRL_MSB    _u(31)
#define DMA_CH15_AL3_CTRL_LSB    _u(0)
#define DMA_CH15_AL3_CTRL_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL3_WRITE_ADDR
// Description : Alias for channel 15 WRITE_ADDR register
#define DMA_CH15_AL3_WRITE_ADDR_OFFSET _u(0x000003f4)
#define DMA_CH15_AL3_WRITE_ADDR_BITS   _u(0xffffffff)
#define DMA_CH15_AL3_WRITE_ADDR_RESET  "-"
#define DMA_CH15_AL3_WRITE_ADDR_MSB    _u(31)
#define DMA_CH15_AL3_WRITE_ADDR_LSB    _u(0)
#define DMA_CH15_AL3_WRITE_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL3_TRANS_COUNT
// Description : Alias for channel 15 TRANS_COUNT register
#define DMA_CH15_AL3_TRANS_COUNT_OFFSET _u(0x000003f8)
#define DMA_CH15_AL3_TRANS_COUNT_BITS   _u(0xffffffff)
#define DMA_CH15_AL3_TRANS_COUNT_RESET  "-"
#define DMA_CH15_AL3_TRANS_COUNT_MSB    _u(31)
#define DMA_CH15_AL3_TRANS_COUNT_LSB    _u(0)
#define DMA_CH15_AL3_TRANS_COUNT_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH15_AL3_READ_ADDR_TRIG
// Description : Alias for channel 15 READ_ADDR register
//               This is a trigger register (0xc). Writing a nonzero value will
//               reload the channel counter and start the channel.
#define DMA_CH15_AL3_READ_ADDR_TRIG_OFFSET _u(0x000003fc)
#define DMA_CH15_AL3_READ_ADDR_TRIG_BITS   _u(0xffffffff)
#define DMA_CH15_AL3_READ_ADDR_TRIG_RESET  "-"
#define DMA_CH15_AL3_READ_ADDR_TRIG_MSB    _u(31)
#define DMA_CH15_AL3_READ_ADDR_TRIG_LSB    _u(0)
#define DMA_CH15_AL3_READ_ADDR_TRIG_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTR
// Description : Interrupt Status (raw)
//               Raw interrupt status for DMA Channels 0..15. Bit n corresponds
//               to channel n. Ignores any masking or forcing. Channel
//               interrupts can be cleared by writing a bit mask to INTR or
//               INTS0/1/2/3.
//
//               Channel interrupts can be routed to either of four system-level
//               IRQs based on INTE0, INTE1, INTE2 and INTE3.
//
//               The multiple system-level interrupts might be used to allow
//               NVIC IRQ preemption for more time-critical channels, to spread
//               IRQ load across different cores, or to target IRQs to different
//               security domains.
//
//               It is also valid to ignore the multiple IRQs, and just use
//               INTE0/INTS0/IRQ 0.
//
//               If this register is accessed at a security/privilege level less
//               than that of a given channel (as defined by that channel's
//               SECCFG_CHx register), then that channel's interrupt status will
//               read as 0, ignore writes.
#define DMA_INTR_OFFSET _u(0x00000400)
#define DMA_INTR_BITS   _u(0x0000ffff)
#define DMA_INTR_RESET  _u(0x00000000)
#define DMA_INTR_MSB    _u(15)
#define DMA_INTR_LSB    _u(0)
#define DMA_INTR_ACCESS "WC"
// =============================================================================
// Register    : DMA_INTE0
// Description : Interrupt Enables for IRQ 0
//               Set bit n to pass interrupts from channel n to DMA IRQ 0.
//
//               Note this bit has no effect if the channel security/privilege
//               level, defined by SECCFG_CHx, is greater than the IRQ
//               security/privilege defined by SECCFG_IRQ0.
#define DMA_INTE0_OFFSET _u(0x00000404)
#define DMA_INTE0_BITS   _u(0x0000ffff)
#define DMA_INTE0_RESET  _u(0x00000000)
#define DMA_INTE0_MSB    _u(15)
#define DMA_INTE0_LSB    _u(0)
#define DMA_INTE0_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTF0
// Description : Force Interrupts
//               Write 1s to force the corresponding bits in INTS0. The
//               interrupt remains asserted until INTF0 is cleared.
#define DMA_INTF0_OFFSET _u(0x00000408)
#define DMA_INTF0_BITS   _u(0x0000ffff)
#define DMA_INTF0_RESET  _u(0x00000000)
#define DMA_INTF0_MSB    _u(15)
#define DMA_INTF0_LSB    _u(0)
#define DMA_INTF0_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTS0
// Description : Interrupt Status for IRQ 0
//               Indicates active channel interrupt requests which are currently
//               causing IRQ 0 to be asserted.
//               Channel interrupts can be cleared by writing a bit mask here.
//
//               Channels with a security/privilege (SECCFG_CHx) greater
//               SECCFG_IRQ0) read as 0 in this register, and ignore writes.
#define DMA_INTS0_OFFSET _u(0x0000040c)
#define DMA_INTS0_BITS   _u(0x0000ffff)
#define DMA_INTS0_RESET  _u(0x00000000)
#define DMA_INTS0_MSB    _u(15)
#define DMA_INTS0_LSB    _u(0)
#define DMA_INTS0_ACCESS "WC"
// =============================================================================
// Register    : DMA_INTE1
// Description : Interrupt Enables for IRQ 1
//               Set bit n to pass interrupts from channel n to DMA IRQ 1.
//
//               Note this bit has no effect if the channel security/privilege
//               level, defined by SECCFG_CHx, is greater than the IRQ
//               security/privilege defined by SECCFG_IRQ1.
#define DMA_INTE1_OFFSET _u(0x00000414)
#define DMA_INTE1_BITS   _u(0x0000ffff)
#define DMA_INTE1_RESET  _u(0x00000000)
#define DMA_INTE1_MSB    _u(15)
#define DMA_INTE1_LSB    _u(0)
#define DMA_INTE1_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTF1
// Description : Force Interrupts
//               Write 1s to force the corresponding bits in INTS1. The
//               interrupt remains asserted until INTF1 is cleared.
#define DMA_INTF1_OFFSET _u(0x00000418)
#define DMA_INTF1_BITS   _u(0x0000ffff)
#define DMA_INTF1_RESET  _u(0x00000000)
#define DMA_INTF1_MSB    _u(15)
#define DMA_INTF1_LSB    _u(0)
#define DMA_INTF1_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTS1
// Description : Interrupt Status for IRQ 1
//               Indicates active channel interrupt requests which are currently
//               causing IRQ 1 to be asserted.
//               Channel interrupts can be cleared by writing a bit mask here.
//
//               Channels with a security/privilege (SECCFG_CHx) greater
//               SECCFG_IRQ1) read as 0 in this register, and ignore writes.
#define DMA_INTS1_OFFSET _u(0x0000041c)
#define DMA_INTS1_BITS   _u(0x0000ffff)
#define DMA_INTS1_RESET  _u(0x00000000)
#define DMA_INTS1_MSB    _u(15)
#define DMA_INTS1_LSB    _u(0)
#define DMA_INTS1_ACCESS "WC"
// =============================================================================
// Register    : DMA_INTE2
// Description : Interrupt Enables for IRQ 2
//               Set bit n to pass interrupts from channel n to DMA IRQ 2.
//
//               Note this bit has no effect if the channel security/privilege
//               level, defined by SECCFG_CHx, is greater than the IRQ
//               security/privilege defined by SECCFG_IRQ2.
#define DMA_INTE2_OFFSET _u(0x00000424)
#define DMA_INTE2_BITS   _u(0x0000ffff)
#define DMA_INTE2_RESET  _u(0x00000000)
#define DMA_INTE2_MSB    _u(15)
#define DMA_INTE2_LSB    _u(0)
#define DMA_INTE2_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTF2
// Description : Force Interrupts
//               Write 1s to force the corresponding bits in INTS2. The
//               interrupt remains asserted until INTF2 is cleared.
#define DMA_INTF2_OFFSET _u(0x00000428)
#define DMA_INTF2_BITS   _u(0x0000ffff)
#define DMA_INTF2_RESET  _u(0x00000000)
#define DMA_INTF2_MSB    _u(15)
#define DMA_INTF2_LSB    _u(0)
#define DMA_INTF2_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTS2
// Description : Interrupt Status for IRQ 2
//               Indicates active channel interrupt requests which are currently
//               causing IRQ 2 to be asserted.
//               Channel interrupts can be cleared by writing a bit mask here.
//
//               Channels with a security/privilege (SECCFG_CHx) greater
//               SECCFG_IRQ2) read as 0 in this register, and ignore writes.
#define DMA_INTS2_OFFSET _u(0x0000042c)
#define DMA_INTS2_BITS   _u(0x0000ffff)
#define DMA_INTS2_RESET  _u(0x00000000)
#define DMA_INTS2_MSB    _u(15)
#define DMA_INTS2_LSB    _u(0)
#define DMA_INTS2_ACCESS "WC"
// =============================================================================
// Register    : DMA_INTE3
// Description : Interrupt Enables for IRQ 3
//               Set bit n to pass interrupts from channel n to DMA IRQ 3.
//
//               Note this bit has no effect if the channel security/privilege
//               level, defined by SECCFG_CHx, is greater than the IRQ
//               security/privilege defined by SECCFG_IRQ3.
#define DMA_INTE3_OFFSET _u(0x00000434)
#define DMA_INTE3_BITS   _u(0x0000ffff)
#define DMA_INTE3_RESET  _u(0x00000000)
#define DMA_INTE3_MSB    _u(15)
#define DMA_INTE3_LSB    _u(0)
#define DMA_INTE3_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTF3
// Description : Force Interrupts
//               Write 1s to force the corresponding bits in INTS3. The
//               interrupt remains asserted until INTF3 is cleared.
#define DMA_INTF3_OFFSET _u(0x00000438)
#define DMA_INTF3_BITS   _u(0x0000ffff)
#define DMA_INTF3_RESET  _u(0x00000000)
#define DMA_INTF3_MSB    _u(15)
#define DMA_INTF3_LSB    _u(0)
#define DMA_INTF3_ACCESS "RW"
// =============================================================================
// Register    : DMA_INTS3
// Description : Interrupt Status for IRQ 3
//               Indicates active channel interrupt requests which are currently
//               causing IRQ 3 to be asserted.
//               Channel interrupts can be cleared by writing a bit mask here.
//
//               Channels with a security/privilege (SECCFG_CHx) greater
//               SECCFG_IRQ3) read as 0 in this register, and ignore writes.
#define DMA_INTS3_OFFSET _u(0x0000043c)
#define DMA_INTS3_BITS   _u(0x0000ffff)
#define DMA_INTS3_RESET  _u(0x00000000)
#define DMA_INTS3_MSB    _u(15)
#define DMA_INTS3_LSB    _u(0)
#define DMA_INTS3_ACCESS "WC"
// =============================================================================
// Register    : DMA_TIMER0
// Description : Pacing (X/Y) fractional timer
//               The pacing timer produces TREQ assertions at a rate set by
//               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
//               cycles and therefore can only generate TREQs at a rate of 1 per
//               sys_clk (i.e. permanent TREQ) or less.
#define DMA_TIMER0_OFFSET _u(0x00000440)
#define DMA_TIMER0_BITS   _u(0xffffffff)
#define DMA_TIMER0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER0_X
// Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
//               fractional timer.
#define DMA_TIMER0_X_RESET  _u(0x0000)
#define DMA_TIMER0_X_BITS   _u(0xffff0000)
#define DMA_TIMER0_X_MSB    _u(31)
#define DMA_TIMER0_X_LSB    _u(16)
#define DMA_TIMER0_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER0_Y
// Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
//               fractional timer.
#define DMA_TIMER0_Y_RESET  _u(0x0000)
