Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
#define DMA_TIMER0_Y_BITS   _u(0x0000ffff)
#define DMA_TIMER0_Y_MSB    _u(15)
#define DMA_TIMER0_Y_LSB    _u(0)
#define DMA_TIMER0_Y_ACCESS "RW"
// =============================================================================
// Register    : DMA_TIMER1
// Description : Pacing (X/Y) fractional timer
//               The pacing timer produces TREQ assertions at a rate set by
//               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
//               cycles and therefore can only generate TREQs at a rate of 1 per
//               sys_clk (i.e. permanent TREQ) or less.
#define DMA_TIMER1_OFFSET _u(0x00000444)
#define DMA_TIMER1_BITS   _u(0xffffffff)
#define DMA_TIMER1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER1_X
// Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
//               fractional timer.
#define DMA_TIMER1_X_RESET  _u(0x0000)
#define DMA_TIMER1_X_BITS   _u(0xffff0000)
#define DMA_TIMER1_X_MSB    _u(31)
#define DMA_TIMER1_X_LSB    _u(16)
#define DMA_TIMER1_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER1_Y
// Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
//               fractional timer.
#define DMA_TIMER1_Y_RESET  _u(0x0000)
#define DMA_TIMER1_Y_BITS   _u(0x0000ffff)
#define DMA_TIMER1_Y_MSB    _u(15)
#define DMA_TIMER1_Y_LSB    _u(0)
#define DMA_TIMER1_Y_ACCESS "RW"
// =============================================================================
// Register    : DMA_TIMER2
// Description : Pacing (X/Y) fractional timer
//               The pacing timer produces TREQ assertions at a rate set by
//               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
//               cycles and therefore can only generate TREQs at a rate of 1 per
//               sys_clk (i.e. permanent TREQ) or less.
#define DMA_TIMER2_OFFSET _u(0x00000448)
#define DMA_TIMER2_BITS   _u(0xffffffff)
#define DMA_TIMER2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER2_X
// Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
//               fractional timer.
#define DMA_TIMER2_X_RESET  _u(0x0000)
#define DMA_TIMER2_X_BITS   _u(0xffff0000)
#define DMA_TIMER2_X_MSB    _u(31)
#define DMA_TIMER2_X_LSB    _u(16)
#define DMA_TIMER2_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER2_Y
// Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
//               fractional timer.
#define DMA_TIMER2_Y_RESET  _u(0x0000)
#define DMA_TIMER2_Y_BITS   _u(0x0000ffff)
#define DMA_TIMER2_Y_MSB    _u(15)
#define DMA_TIMER2_Y_LSB    _u(0)
#define DMA_TIMER2_Y_ACCESS "RW"
// =============================================================================
// Register    : DMA_TIMER3
// Description : Pacing (X/Y) fractional timer
//               The pacing timer produces TREQ assertions at a rate set by
//               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
//               cycles and therefore can only generate TREQs at a rate of 1 per
//               sys_clk (i.e. permanent TREQ) or less.
#define DMA_TIMER3_OFFSET _u(0x0000044c)
#define DMA_TIMER3_BITS   _u(0xffffffff)
#define DMA_TIMER3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER3_X
// Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
//               fractional timer.
#define DMA_TIMER3_X_RESET  _u(0x0000)
#define DMA_TIMER3_X_BITS   _u(0xffff0000)
#define DMA_TIMER3_X_MSB    _u(31)
#define DMA_TIMER3_X_LSB    _u(16)
#define DMA_TIMER3_X_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_TIMER3_Y
// Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
//               fractional timer.
#define DMA_TIMER3_Y_RESET  _u(0x0000)
#define DMA_TIMER3_Y_BITS   _u(0x0000ffff)
#define DMA_TIMER3_Y_MSB    _u(15)
#define DMA_TIMER3_Y_LSB    _u(0)
#define DMA_TIMER3_Y_ACCESS "RW"
// =============================================================================
// Register    : DMA_MULTI_CHAN_TRIGGER
// Description : Trigger one or more channels simultaneously
//               Each bit in this register corresponds to a DMA channel. Writing
//               a 1 to the relevant bit is the same as writing to that
//               channel's trigger register; the channel will start if it is
//               currently enabled and not already busy.
#define DMA_MULTI_CHAN_TRIGGER_OFFSET _u(0x00000450)
#define DMA_MULTI_CHAN_TRIGGER_BITS   _u(0x0000ffff)
#define DMA_MULTI_CHAN_TRIGGER_RESET  _u(0x00000000)
#define DMA_MULTI_CHAN_TRIGGER_MSB    _u(15)
#define DMA_MULTI_CHAN_TRIGGER_LSB    _u(0)
#define DMA_MULTI_CHAN_TRIGGER_ACCESS "SC"
// =============================================================================
// Register    : DMA_SNIFF_CTRL
// Description : Sniffer Control
#define DMA_SNIFF_CTRL_OFFSET _u(0x00000454)
#define DMA_SNIFF_CTRL_BITS   _u(0x00000fff)
#define DMA_SNIFF_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_OUT_INV
// Description : If set, the result appears inverted (bitwise complement) when
//               read. This does not affect the way the checksum is calculated;
//               the result is transformed on-the-fly between the result
//               register and the bus.
#define DMA_SNIFF_CTRL_OUT_INV_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_OUT_INV_BITS   _u(0x00000800)
#define DMA_SNIFF_CTRL_OUT_INV_MSB    _u(11)
#define DMA_SNIFF_CTRL_OUT_INV_LSB    _u(11)
#define DMA_SNIFF_CTRL_OUT_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_OUT_REV
// Description : If set, the result appears bit-reversed when read. This does
//               not affect the way the checksum is calculated; the result is
//               transformed on-the-fly between the result register and the bus.
#define DMA_SNIFF_CTRL_OUT_REV_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_OUT_REV_BITS   _u(0x00000400)
#define DMA_SNIFF_CTRL_OUT_REV_MSB    _u(10)
#define DMA_SNIFF_CTRL_OUT_REV_LSB    _u(10)
#define DMA_SNIFF_CTRL_OUT_REV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_BSWAP
// Description : Locally perform a byte reverse on the sniffed data, before
//               feeding into checksum.
//
//               Note that the sniff hardware is downstream of the DMA channel
//               byteswap performed in the read master: if channel CTRL_BSWAP
//               and SNIFF_CTRL_BSWAP are both enabled, their effects cancel
//               from the sniffer's point of view.
#define DMA_SNIFF_CTRL_BSWAP_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_BSWAP_BITS   _u(0x00000200)
#define DMA_SNIFF_CTRL_BSWAP_MSB    _u(9)
#define DMA_SNIFF_CTRL_BSWAP_LSB    _u(9)
#define DMA_SNIFF_CTRL_BSWAP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_CALC
//               0x0 -> Calculate a CRC-32 (IEEE802.3 polynomial)
//               0x1 -> Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data
//               0x2 -> Calculate a CRC-16-CCITT
//               0x3 -> Calculate a CRC-16-CCITT with bit reversed data
//               0xe -> XOR reduction over all data. == 1 if the total 1 population count is odd.
//               0xf -> Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)
#define DMA_SNIFF_CTRL_CALC_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_CALC_BITS   _u(0x000001e0)
#define DMA_SNIFF_CTRL_CALC_MSB    _u(8)
#define DMA_SNIFF_CTRL_CALC_LSB    _u(5)
#define DMA_SNIFF_CTRL_CALC_ACCESS "RW"
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC32 _u(0x0)
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC32R _u(0x1)
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC16 _u(0x2)
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC16R _u(0x3)
#define DMA_SNIFF_CTRL_CALC_VALUE_EVEN _u(0xe)
#define DMA_SNIFF_CTRL_CALC_VALUE_SUM _u(0xf)
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_DMACH
// Description : DMA channel for Sniffer to observe
#define DMA_SNIFF_CTRL_DMACH_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_DMACH_BITS   _u(0x0000001e)
#define DMA_SNIFF_CTRL_DMACH_MSB    _u(4)
#define DMA_SNIFF_CTRL_DMACH_LSB    _u(1)
#define DMA_SNIFF_CTRL_DMACH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SNIFF_CTRL_EN
// Description : Enable sniffer
#define DMA_SNIFF_CTRL_EN_RESET  _u(0x0)
#define DMA_SNIFF_CTRL_EN_BITS   _u(0x00000001)
#define DMA_SNIFF_CTRL_EN_MSB    _u(0)
#define DMA_SNIFF_CTRL_EN_LSB    _u(0)
#define DMA_SNIFF_CTRL_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_SNIFF_DATA
// Description : Data accumulator for sniff hardware
//               Write an initial seed value here before starting a DMA transfer
//               on the channel indicated by SNIFF_CTRL_DMACH. The hardware will
//               update this register each time it observes a read from the
//               indicated channel. Once the channel completes, the final result
//               can be read from this register.
#define DMA_SNIFF_DATA_OFFSET _u(0x00000458)
#define DMA_SNIFF_DATA_BITS   _u(0xffffffff)
#define DMA_SNIFF_DATA_RESET  _u(0x00000000)
#define DMA_SNIFF_DATA_MSB    _u(31)
#define DMA_SNIFF_DATA_LSB    _u(0)
#define DMA_SNIFF_DATA_ACCESS "RW"
// =============================================================================
// Register    : DMA_FIFO_LEVELS
// Description : Debug RAF, WAF, TDF levels
#define DMA_FIFO_LEVELS_OFFSET _u(0x00000460)
#define DMA_FIFO_LEVELS_BITS   _u(0x00ffffff)
#define DMA_FIFO_LEVELS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_FIFO_LEVELS_RAF_LVL
// Description : Current Read-Address-FIFO fill level
#define DMA_FIFO_LEVELS_RAF_LVL_RESET  _u(0x00)
#define DMA_FIFO_LEVELS_RAF_LVL_BITS   _u(0x00ff0000)
#define DMA_FIFO_LEVELS_RAF_LVL_MSB    _u(23)
#define DMA_FIFO_LEVELS_RAF_LVL_LSB    _u(16)
#define DMA_FIFO_LEVELS_RAF_LVL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : DMA_FIFO_LEVELS_WAF_LVL
// Description : Current Write-Address-FIFO fill level
#define DMA_FIFO_LEVELS_WAF_LVL_RESET  _u(0x00)
#define DMA_FIFO_LEVELS_WAF_LVL_BITS   _u(0x0000ff00)
#define DMA_FIFO_LEVELS_WAF_LVL_MSB    _u(15)
#define DMA_FIFO_LEVELS_WAF_LVL_LSB    _u(8)
#define DMA_FIFO_LEVELS_WAF_LVL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : DMA_FIFO_LEVELS_TDF_LVL
// Description : Current Transfer-Data-FIFO fill level
#define DMA_FIFO_LEVELS_TDF_LVL_RESET  _u(0x00)
#define DMA_FIFO_LEVELS_TDF_LVL_BITS   _u(0x000000ff)
#define DMA_FIFO_LEVELS_TDF_LVL_MSB    _u(7)
#define DMA_FIFO_LEVELS_TDF_LVL_LSB    _u(0)
#define DMA_FIFO_LEVELS_TDF_LVL_ACCESS "RO"
// =============================================================================
// Register    : DMA_CHAN_ABORT
// Description : Abort an in-progress transfer sequence on one or more channels
//               Each bit corresponds to a channel. Writing a 1 aborts whatever
//               transfer sequence is in progress on that channel. The bit will
//               remain high until any in-flight transfers have been flushed
//               through the address and data FIFOs.
//
//               After writing, this register must be polled until it returns
//               all-zero. Until this point, it is unsafe to restart the
//               channel.
#define DMA_CHAN_ABORT_OFFSET _u(0x00000464)
#define DMA_CHAN_ABORT_BITS   _u(0x0000ffff)
#define DMA_CHAN_ABORT_RESET  _u(0x00000000)
#define DMA_CHAN_ABORT_MSB    _u(15)
#define DMA_CHAN_ABORT_LSB    _u(0)
#define DMA_CHAN_ABORT_ACCESS "SC"
// =============================================================================
// Register    : DMA_N_CHANNELS
// Description : The number of channels this DMA instance is equipped with. This
//               DMA supports up to 16 hardware channels, but can be configured
//               with as few as one, to minimise silicon area.
#define DMA_N_CHANNELS_OFFSET _u(0x00000468)
#define DMA_N_CHANNELS_BITS   _u(0x0000001f)
#define DMA_N_CHANNELS_RESET  "-"
#define DMA_N_CHANNELS_MSB    _u(4)
#define DMA_N_CHANNELS_LSB    _u(0)
#define DMA_N_CHANNELS_ACCESS "RO"
// =============================================================================
// Register    : DMA_SECCFG_CH0
// Description : Security configuration for channel 0. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH0_OFFSET _u(0x00000480)
#define DMA_SECCFG_CH0_BITS   _u(0x00000007)
#define DMA_SECCFG_CH0_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH0_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH0_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH0_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH0_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH0_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH0_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH0_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH0_S_RESET  _u(0x1)
#define DMA_SECCFG_CH0_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH0_S_MSB    _u(1)
#define DMA_SECCFG_CH0_S_LSB    _u(1)
#define DMA_SECCFG_CH0_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH0_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH0_P_RESET  _u(0x1)
#define DMA_SECCFG_CH0_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH0_P_MSB    _u(0)
#define DMA_SECCFG_CH0_P_LSB    _u(0)
#define DMA_SECCFG_CH0_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH1
// Description : Security configuration for channel 1. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH1_OFFSET _u(0x00000484)
#define DMA_SECCFG_CH1_BITS   _u(0x00000007)
#define DMA_SECCFG_CH1_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH1_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH1_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH1_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH1_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH1_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH1_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH1_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH1_S_RESET  _u(0x1)
#define DMA_SECCFG_CH1_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH1_S_MSB    _u(1)
#define DMA_SECCFG_CH1_S_LSB    _u(1)
#define DMA_SECCFG_CH1_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH1_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH1_P_RESET  _u(0x1)
#define DMA_SECCFG_CH1_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH1_P_MSB    _u(0)
#define DMA_SECCFG_CH1_P_LSB    _u(0)
#define DMA_SECCFG_CH1_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH2
// Description : Security configuration for channel 2. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH2_OFFSET _u(0x00000488)
#define DMA_SECCFG_CH2_BITS   _u(0x00000007)
#define DMA_SECCFG_CH2_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH2_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH2_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH2_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH2_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH2_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH2_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH2_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH2_S_RESET  _u(0x1)
#define DMA_SECCFG_CH2_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH2_S_MSB    _u(1)
#define DMA_SECCFG_CH2_S_LSB    _u(1)
#define DMA_SECCFG_CH2_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH2_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH2_P_RESET  _u(0x1)
#define DMA_SECCFG_CH2_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH2_P_MSB    _u(0)
#define DMA_SECCFG_CH2_P_LSB    _u(0)
#define DMA_SECCFG_CH2_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH3
// Description : Security configuration for channel 3. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH3_OFFSET _u(0x0000048c)
#define DMA_SECCFG_CH3_BITS   _u(0x00000007)
#define DMA_SECCFG_CH3_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH3_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
