Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
//               will not set the LOCK bit.
#define DMA_SECCFG_CH3_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH3_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH3_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH3_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH3_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH3_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH3_S_RESET  _u(0x1)
#define DMA_SECCFG_CH3_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH3_S_MSB    _u(1)
#define DMA_SECCFG_CH3_S_LSB    _u(1)
#define DMA_SECCFG_CH3_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH3_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH3_P_RESET  _u(0x1)
#define DMA_SECCFG_CH3_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH3_P_MSB    _u(0)
#define DMA_SECCFG_CH3_P_LSB    _u(0)
#define DMA_SECCFG_CH3_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH4
// Description : Security configuration for channel 4. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH4_OFFSET _u(0x00000490)
#define DMA_SECCFG_CH4_BITS   _u(0x00000007)
#define DMA_SECCFG_CH4_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH4_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH4_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH4_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH4_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH4_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH4_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH4_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH4_S_RESET  _u(0x1)
#define DMA_SECCFG_CH4_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH4_S_MSB    _u(1)
#define DMA_SECCFG_CH4_S_LSB    _u(1)
#define DMA_SECCFG_CH4_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH4_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH4_P_RESET  _u(0x1)
#define DMA_SECCFG_CH4_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH4_P_MSB    _u(0)
#define DMA_SECCFG_CH4_P_LSB    _u(0)
#define DMA_SECCFG_CH4_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH5
// Description : Security configuration for channel 5. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH5_OFFSET _u(0x00000494)
#define DMA_SECCFG_CH5_BITS   _u(0x00000007)
#define DMA_SECCFG_CH5_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH5_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH5_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH5_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH5_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH5_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH5_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH5_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH5_S_RESET  _u(0x1)
#define DMA_SECCFG_CH5_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH5_S_MSB    _u(1)
#define DMA_SECCFG_CH5_S_LSB    _u(1)
#define DMA_SECCFG_CH5_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH5_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH5_P_RESET  _u(0x1)
#define DMA_SECCFG_CH5_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH5_P_MSB    _u(0)
#define DMA_SECCFG_CH5_P_LSB    _u(0)
#define DMA_SECCFG_CH5_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH6
// Description : Security configuration for channel 6. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH6_OFFSET _u(0x00000498)
#define DMA_SECCFG_CH6_BITS   _u(0x00000007)
#define DMA_SECCFG_CH6_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH6_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH6_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH6_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH6_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH6_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH6_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH6_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH6_S_RESET  _u(0x1)
#define DMA_SECCFG_CH6_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH6_S_MSB    _u(1)
#define DMA_SECCFG_CH6_S_LSB    _u(1)
#define DMA_SECCFG_CH6_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH6_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH6_P_RESET  _u(0x1)
#define DMA_SECCFG_CH6_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH6_P_MSB    _u(0)
#define DMA_SECCFG_CH6_P_LSB    _u(0)
#define DMA_SECCFG_CH6_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH7
// Description : Security configuration for channel 7. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH7_OFFSET _u(0x0000049c)
#define DMA_SECCFG_CH7_BITS   _u(0x00000007)
#define DMA_SECCFG_CH7_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH7_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH7_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH7_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH7_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH7_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH7_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH7_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH7_S_RESET  _u(0x1)
#define DMA_SECCFG_CH7_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH7_S_MSB    _u(1)
#define DMA_SECCFG_CH7_S_LSB    _u(1)
#define DMA_SECCFG_CH7_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH7_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH7_P_RESET  _u(0x1)
#define DMA_SECCFG_CH7_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH7_P_MSB    _u(0)
#define DMA_SECCFG_CH7_P_LSB    _u(0)
#define DMA_SECCFG_CH7_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH8
// Description : Security configuration for channel 8. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH8_OFFSET _u(0x000004a0)
#define DMA_SECCFG_CH8_BITS   _u(0x00000007)
#define DMA_SECCFG_CH8_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH8_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH8_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH8_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH8_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH8_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH8_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH8_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH8_S_RESET  _u(0x1)
#define DMA_SECCFG_CH8_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH8_S_MSB    _u(1)
#define DMA_SECCFG_CH8_S_LSB    _u(1)
#define DMA_SECCFG_CH8_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH8_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH8_P_RESET  _u(0x1)
#define DMA_SECCFG_CH8_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH8_P_MSB    _u(0)
#define DMA_SECCFG_CH8_P_LSB    _u(0)
#define DMA_SECCFG_CH8_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH9
// Description : Security configuration for channel 9. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH9_OFFSET _u(0x000004a4)
#define DMA_SECCFG_CH9_BITS   _u(0x00000007)
#define DMA_SECCFG_CH9_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH9_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH9_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH9_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH9_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH9_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH9_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH9_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH9_S_RESET  _u(0x1)
#define DMA_SECCFG_CH9_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH9_S_MSB    _u(1)
#define DMA_SECCFG_CH9_S_LSB    _u(1)
#define DMA_SECCFG_CH9_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH9_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH9_P_RESET  _u(0x1)
#define DMA_SECCFG_CH9_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH9_P_MSB    _u(0)
#define DMA_SECCFG_CH9_P_LSB    _u(0)
#define DMA_SECCFG_CH9_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH10
// Description : Security configuration for channel 10. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH10_OFFSET _u(0x000004a8)
#define DMA_SECCFG_CH10_BITS   _u(0x00000007)
#define DMA_SECCFG_CH10_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH10_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH10_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH10_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH10_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH10_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH10_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH10_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH10_S_RESET  _u(0x1)
#define DMA_SECCFG_CH10_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH10_S_MSB    _u(1)
#define DMA_SECCFG_CH10_S_LSB    _u(1)
#define DMA_SECCFG_CH10_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH10_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH10_P_RESET  _u(0x1)
#define DMA_SECCFG_CH10_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH10_P_MSB    _u(0)
#define DMA_SECCFG_CH10_P_LSB    _u(0)
#define DMA_SECCFG_CH10_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH11
// Description : Security configuration for channel 11. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
