Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH11_OFFSET _u(0x000004ac)
#define DMA_SECCFG_CH11_BITS   _u(0x00000007)
#define DMA_SECCFG_CH11_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH11_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH11_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH11_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH11_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH11_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH11_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH11_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH11_S_RESET  _u(0x1)
#define DMA_SECCFG_CH11_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH11_S_MSB    _u(1)
#define DMA_SECCFG_CH11_S_LSB    _u(1)
#define DMA_SECCFG_CH11_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH11_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH11_P_RESET  _u(0x1)
#define DMA_SECCFG_CH11_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH11_P_MSB    _u(0)
#define DMA_SECCFG_CH11_P_LSB    _u(0)
#define DMA_SECCFG_CH11_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH12
// Description : Security configuration for channel 12. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH12_OFFSET _u(0x000004b0)
#define DMA_SECCFG_CH12_BITS   _u(0x00000007)
#define DMA_SECCFG_CH12_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH12_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH12_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH12_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH12_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH12_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH12_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH12_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH12_S_RESET  _u(0x1)
#define DMA_SECCFG_CH12_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH12_S_MSB    _u(1)
#define DMA_SECCFG_CH12_S_LSB    _u(1)
#define DMA_SECCFG_CH12_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH12_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH12_P_RESET  _u(0x1)
#define DMA_SECCFG_CH12_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH12_P_MSB    _u(0)
#define DMA_SECCFG_CH12_P_LSB    _u(0)
#define DMA_SECCFG_CH12_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH13
// Description : Security configuration for channel 13. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH13_OFFSET _u(0x000004b4)
#define DMA_SECCFG_CH13_BITS   _u(0x00000007)
#define DMA_SECCFG_CH13_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH13_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH13_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH13_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH13_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH13_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH13_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH13_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH13_S_RESET  _u(0x1)
#define DMA_SECCFG_CH13_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH13_S_MSB    _u(1)
#define DMA_SECCFG_CH13_S_LSB    _u(1)
#define DMA_SECCFG_CH13_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH13_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH13_P_RESET  _u(0x1)
#define DMA_SECCFG_CH13_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH13_P_MSB    _u(0)
#define DMA_SECCFG_CH13_P_LSB    _u(0)
#define DMA_SECCFG_CH13_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH14
// Description : Security configuration for channel 14. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH14_OFFSET _u(0x000004b8)
#define DMA_SECCFG_CH14_BITS   _u(0x00000007)
#define DMA_SECCFG_CH14_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH14_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH14_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH14_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH14_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH14_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH14_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH14_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH14_S_RESET  _u(0x1)
#define DMA_SECCFG_CH14_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH14_S_MSB    _u(1)
#define DMA_SECCFG_CH14_S_LSB    _u(1)
#define DMA_SECCFG_CH14_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH14_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH14_P_RESET  _u(0x1)
#define DMA_SECCFG_CH14_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH14_P_MSB    _u(0)
#define DMA_SECCFG_CH14_P_LSB    _u(0)
#define DMA_SECCFG_CH14_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_CH15
// Description : Security configuration for channel 15. Control whether this
//               channel performs Secure/Non-secure and Privileged/Unprivileged
//               bus accesses.
//
//               If this channel generates bus accesses of some security level,
//               an access of at least that level (in the order S+P > S+U > NS+P
//               > NS+U) is required to program, trigger, abort, check the
//               status of, interrupt on or acknowledge the interrupt of this
//               channel.
//
//               This register automatically locks down (becomes read-only) once
//               software starts to configure the channel.
//
//               This register is world-readable, but is writable only from a
//               Secure, Privileged context.
#define DMA_SECCFG_CH15_OFFSET _u(0x000004bc)
#define DMA_SECCFG_CH15_BITS   _u(0x00000007)
#define DMA_SECCFG_CH15_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH15_LOCK
// Description : LOCK is 0 at reset, and is set to 1 automatically upon a
//               successful write to this channel's control registers. That is,
//               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
//               aliases.
//
//               Once its LOCK bit is set, this register becomes read-only.
//
//               A failed write, for example due to the write's privilege being
//               lower than that specified in the channel's SECCFG register,
//               will not set the LOCK bit.
#define DMA_SECCFG_CH15_LOCK_RESET  _u(0x0)
#define DMA_SECCFG_CH15_LOCK_BITS   _u(0x00000004)
#define DMA_SECCFG_CH15_LOCK_MSB    _u(2)
#define DMA_SECCFG_CH15_LOCK_LSB    _u(2)
#define DMA_SECCFG_CH15_LOCK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH15_S
// Description : Secure channel. If 1, this channel performs Secure bus
//               accesses. If 0, it performs Non-secure bus accesses.
//
//               If 1, this channel is controllable only from a Secure context.
#define DMA_SECCFG_CH15_S_RESET  _u(0x1)
#define DMA_SECCFG_CH15_S_BITS   _u(0x00000002)
#define DMA_SECCFG_CH15_S_MSB    _u(1)
#define DMA_SECCFG_CH15_S_LSB    _u(1)
#define DMA_SECCFG_CH15_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_CH15_P
// Description : Privileged channel. If 1, this channel performs Privileged bus
//               accesses. If 0, it performs Unprivileged bus accesses.
//
//               If 1, this channel is controllable only from a Privileged
//               context of the same Secure/Non-secure level, or any context of
//               a higher Secure/Non-secure level.
#define DMA_SECCFG_CH15_P_RESET  _u(0x1)
#define DMA_SECCFG_CH15_P_BITS   _u(0x00000001)
#define DMA_SECCFG_CH15_P_MSB    _u(0)
#define DMA_SECCFG_CH15_P_LSB    _u(0)
#define DMA_SECCFG_CH15_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_IRQ0
// Description : Security configuration for IRQ 0. Control whether the IRQ
//               permits configuration by Non-secure/Unprivileged contexts, and
//               whether it can observe Secure/Privileged channel interrupt
//               flags.
#define DMA_SECCFG_IRQ0_OFFSET _u(0x000004c0)
#define DMA_SECCFG_IRQ0_BITS   _u(0x00000003)
#define DMA_SECCFG_IRQ0_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ0_S
// Description : Secure IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Secure context.
//
//               If 0, this IRQ's control registers can be accessed from a Non-
//               secure context, but Secure channels (as per SECCFG_CHx) are
//               masked from the IRQ status, and this IRQ's registers can not be
//               used to acknowledge the channel interrupts of Secure channels.
#define DMA_SECCFG_IRQ0_S_RESET  _u(0x1)
#define DMA_SECCFG_IRQ0_S_BITS   _u(0x00000002)
#define DMA_SECCFG_IRQ0_S_MSB    _u(1)
#define DMA_SECCFG_IRQ0_S_LSB    _u(1)
#define DMA_SECCFG_IRQ0_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ0_P
// Description : Privileged IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Privileged context.
//
//               If 0, this IRQ's control registers can be accessed from an
//               Unprivileged context, but Privileged channels (as per
//               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
//               registers can not be used to acknowledge the channel interrupts
//               of Privileged channels.
#define DMA_SECCFG_IRQ0_P_RESET  _u(0x1)
#define DMA_SECCFG_IRQ0_P_BITS   _u(0x00000001)
#define DMA_SECCFG_IRQ0_P_MSB    _u(0)
#define DMA_SECCFG_IRQ0_P_LSB    _u(0)
#define DMA_SECCFG_IRQ0_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_IRQ1
// Description : Security configuration for IRQ 1. Control whether the IRQ
//               permits configuration by Non-secure/Unprivileged contexts, and
//               whether it can observe Secure/Privileged channel interrupt
//               flags.
#define DMA_SECCFG_IRQ1_OFFSET _u(0x000004c4)
#define DMA_SECCFG_IRQ1_BITS   _u(0x00000003)
#define DMA_SECCFG_IRQ1_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ1_S
// Description : Secure IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Secure context.
//
//               If 0, this IRQ's control registers can be accessed from a Non-
//               secure context, but Secure channels (as per SECCFG_CHx) are
//               masked from the IRQ status, and this IRQ's registers can not be
//               used to acknowledge the channel interrupts of Secure channels.
#define DMA_SECCFG_IRQ1_S_RESET  _u(0x1)
#define DMA_SECCFG_IRQ1_S_BITS   _u(0x00000002)
#define DMA_SECCFG_IRQ1_S_MSB    _u(1)
#define DMA_SECCFG_IRQ1_S_LSB    _u(1)
#define DMA_SECCFG_IRQ1_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ1_P
// Description : Privileged IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Privileged context.
//
//               If 0, this IRQ's control registers can be accessed from an
//               Unprivileged context, but Privileged channels (as per
//               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
//               registers can not be used to acknowledge the channel interrupts
//               of Privileged channels.
#define DMA_SECCFG_IRQ1_P_RESET  _u(0x1)
#define DMA_SECCFG_IRQ1_P_BITS   _u(0x00000001)
#define DMA_SECCFG_IRQ1_P_MSB    _u(0)
#define DMA_SECCFG_IRQ1_P_LSB    _u(0)
#define DMA_SECCFG_IRQ1_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_IRQ2
// Description : Security configuration for IRQ 2. Control whether the IRQ
//               permits configuration by Non-secure/Unprivileged contexts, and
//               whether it can observe Secure/Privileged channel interrupt
//               flags.
#define DMA_SECCFG_IRQ2_OFFSET _u(0x000004c8)
#define DMA_SECCFG_IRQ2_BITS   _u(0x00000003)
#define DMA_SECCFG_IRQ2_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ2_S
// Description : Secure IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Secure context.
//
//               If 0, this IRQ's control registers can be accessed from a Non-
//               secure context, but Secure channels (as per SECCFG_CHx) are
//               masked from the IRQ status, and this IRQ's registers can not be
//               used to acknowledge the channel interrupts of Secure channels.
#define DMA_SECCFG_IRQ2_S_RESET  _u(0x1)
#define DMA_SECCFG_IRQ2_S_BITS   _u(0x00000002)
#define DMA_SECCFG_IRQ2_S_MSB    _u(1)
#define DMA_SECCFG_IRQ2_S_LSB    _u(1)
#define DMA_SECCFG_IRQ2_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ2_P
// Description : Privileged IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Privileged context.
//
//               If 0, this IRQ's control registers can be accessed from an
//               Unprivileged context, but Privileged channels (as per
//               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
//               registers can not be used to acknowledge the channel interrupts
//               of Privileged channels.
#define DMA_SECCFG_IRQ2_P_RESET  _u(0x1)
#define DMA_SECCFG_IRQ2_P_BITS   _u(0x00000001)
#define DMA_SECCFG_IRQ2_P_MSB    _u(0)
#define DMA_SECCFG_IRQ2_P_LSB    _u(0)
#define DMA_SECCFG_IRQ2_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_IRQ3
// Description : Security configuration for IRQ 3. Control whether the IRQ
//               permits configuration by Non-secure/Unprivileged contexts, and
//               whether it can observe Secure/Privileged channel interrupt
//               flags.
#define DMA_SECCFG_IRQ3_OFFSET _u(0x000004cc)
#define DMA_SECCFG_IRQ3_BITS   _u(0x00000003)
#define DMA_SECCFG_IRQ3_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ3_S
// Description : Secure IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Secure context.
//
//               If 0, this IRQ's control registers can be accessed from a Non-
//               secure context, but Secure channels (as per SECCFG_CHx) are
//               masked from the IRQ status, and this IRQ's registers can not be
//               used to acknowledge the channel interrupts of Secure channels.
#define DMA_SECCFG_IRQ3_S_RESET  _u(0x1)
#define DMA_SECCFG_IRQ3_S_BITS   _u(0x00000002)
#define DMA_SECCFG_IRQ3_S_MSB    _u(1)
#define DMA_SECCFG_IRQ3_S_LSB    _u(1)
#define DMA_SECCFG_IRQ3_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_IRQ3_P
// Description : Privileged IRQ. If 1, this IRQ's control registers can only be
//               accessed from a Privileged context.
//
//               If 0, this IRQ's control registers can be accessed from an
//               Unprivileged context, but Privileged channels (as per
//               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
//               registers can not be used to acknowledge the channel interrupts
//               of Privileged channels.
#define DMA_SECCFG_IRQ3_P_RESET  _u(0x1)
#define DMA_SECCFG_IRQ3_P_BITS   _u(0x00000001)
#define DMA_SECCFG_IRQ3_P_MSB    _u(0)
#define DMA_SECCFG_IRQ3_P_LSB    _u(0)
#define DMA_SECCFG_IRQ3_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_SECCFG_MISC
// Description : Miscellaneous security configuration
#define DMA_SECCFG_MISC_OFFSET _u(0x000004d0)
#define DMA_SECCFG_MISC_BITS   _u(0x000003ff)
#define DMA_SECCFG_MISC_RESET  _u(0x000003ff)
