Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER3_S
// Description : If 1, the TIMER3 register is only accessible from a Secure
//               context, and timer DREQ 3 is only visible to Secure channels.
#define DMA_SECCFG_MISC_TIMER3_S_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER3_S_BITS   _u(0x00000200)
#define DMA_SECCFG_MISC_TIMER3_S_MSB    _u(9)
#define DMA_SECCFG_MISC_TIMER3_S_LSB    _u(9)
#define DMA_SECCFG_MISC_TIMER3_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER3_P
// Description : If 1, the TIMER3 register is only accessible from a Privileged
//               (or more Secure) context, and timer DREQ 3 is only visible to
//               Privileged (or more Secure) channels.
#define DMA_SECCFG_MISC_TIMER3_P_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER3_P_BITS   _u(0x00000100)
#define DMA_SECCFG_MISC_TIMER3_P_MSB    _u(8)
#define DMA_SECCFG_MISC_TIMER3_P_LSB    _u(8)
#define DMA_SECCFG_MISC_TIMER3_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER2_S
// Description : If 1, the TIMER2 register is only accessible from a Secure
//               context, and timer DREQ 2 is only visible to Secure channels.
#define DMA_SECCFG_MISC_TIMER2_S_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER2_S_BITS   _u(0x00000080)
#define DMA_SECCFG_MISC_TIMER2_S_MSB    _u(7)
#define DMA_SECCFG_MISC_TIMER2_S_LSB    _u(7)
#define DMA_SECCFG_MISC_TIMER2_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER2_P
// Description : If 1, the TIMER2 register is only accessible from a Privileged
//               (or more Secure) context, and timer DREQ 2 is only visible to
//               Privileged (or more Secure) channels.
#define DMA_SECCFG_MISC_TIMER2_P_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER2_P_BITS   _u(0x00000040)
#define DMA_SECCFG_MISC_TIMER2_P_MSB    _u(6)
#define DMA_SECCFG_MISC_TIMER2_P_LSB    _u(6)
#define DMA_SECCFG_MISC_TIMER2_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER1_S
// Description : If 1, the TIMER1 register is only accessible from a Secure
//               context, and timer DREQ 1 is only visible to Secure channels.
#define DMA_SECCFG_MISC_TIMER1_S_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER1_S_BITS   _u(0x00000020)
#define DMA_SECCFG_MISC_TIMER1_S_MSB    _u(5)
#define DMA_SECCFG_MISC_TIMER1_S_LSB    _u(5)
#define DMA_SECCFG_MISC_TIMER1_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER1_P
// Description : If 1, the TIMER1 register is only accessible from a Privileged
//               (or more Secure) context, and timer DREQ 1 is only visible to
//               Privileged (or more Secure) channels.
#define DMA_SECCFG_MISC_TIMER1_P_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER1_P_BITS   _u(0x00000010)
#define DMA_SECCFG_MISC_TIMER1_P_MSB    _u(4)
#define DMA_SECCFG_MISC_TIMER1_P_LSB    _u(4)
#define DMA_SECCFG_MISC_TIMER1_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER0_S
// Description : If 1, the TIMER0 register is only accessible from a Secure
//               context, and timer DREQ 0 is only visible to Secure channels.
#define DMA_SECCFG_MISC_TIMER0_S_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER0_S_BITS   _u(0x00000008)
#define DMA_SECCFG_MISC_TIMER0_S_MSB    _u(3)
#define DMA_SECCFG_MISC_TIMER0_S_LSB    _u(3)
#define DMA_SECCFG_MISC_TIMER0_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_TIMER0_P
// Description : If 1, the TIMER0 register is only accessible from a Privileged
//               (or more Secure) context, and timer DREQ 0 is only visible to
//               Privileged (or more Secure) channels.
#define DMA_SECCFG_MISC_TIMER0_P_RESET  _u(0x1)
#define DMA_SECCFG_MISC_TIMER0_P_BITS   _u(0x00000004)
#define DMA_SECCFG_MISC_TIMER0_P_MSB    _u(2)
#define DMA_SECCFG_MISC_TIMER0_P_LSB    _u(2)
#define DMA_SECCFG_MISC_TIMER0_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_SNIFF_S
// Description : If 1, the sniffer can see data transfers from Secure channels,
//               and can itself only be accessed from a Secure context.
//
//               If 0, the sniffer can be accessed from either a Secure or Non-
//               secure context, but can not see data transfers of Secure
//               channels.
#define DMA_SECCFG_MISC_SNIFF_S_RESET  _u(0x1)
#define DMA_SECCFG_MISC_SNIFF_S_BITS   _u(0x00000002)
#define DMA_SECCFG_MISC_SNIFF_S_MSB    _u(1)
#define DMA_SECCFG_MISC_SNIFF_S_LSB    _u(1)
#define DMA_SECCFG_MISC_SNIFF_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_SECCFG_MISC_SNIFF_P
// Description : If 1, the sniffer can see data transfers from Privileged
//               channels, and can itself only be accessed from a privileged
//               context, or from a Secure context when SNIFF_S is 0.
//
//               If 0, the sniffer can be accessed from either a Privileged or
//               Unprivileged context (with sufficient security level) but can
//               not see transfers from Privileged channels.
#define DMA_SECCFG_MISC_SNIFF_P_RESET  _u(0x1)
#define DMA_SECCFG_MISC_SNIFF_P_BITS   _u(0x00000001)
#define DMA_SECCFG_MISC_SNIFF_P_MSB    _u(0)
#define DMA_SECCFG_MISC_SNIFF_P_LSB    _u(0)
#define DMA_SECCFG_MISC_SNIFF_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_CTRL
// Description : Control register for DMA MPU. Accessible only from a Privileged
//               context.
#define DMA_MPU_CTRL_OFFSET _u(0x00000500)
#define DMA_MPU_CTRL_BITS   _u(0x0000000e)
#define DMA_MPU_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_CTRL_NS_HIDE_ADDR
// Description : By default, when a region's S bit is clear, Non-secure-
//               Privileged reads can see the region's base address and limit
//               address. Set this bit to make the addresses appear as 0 to Non-
//               secure reads, even when the region is Non-secure, to avoid
//               leaking information about the processor SAU map.
#define DMA_MPU_CTRL_NS_HIDE_ADDR_RESET  _u(0x0)
#define DMA_MPU_CTRL_NS_HIDE_ADDR_BITS   _u(0x00000008)
#define DMA_MPU_CTRL_NS_HIDE_ADDR_MSB    _u(3)
#define DMA_MPU_CTRL_NS_HIDE_ADDR_LSB    _u(3)
#define DMA_MPU_CTRL_NS_HIDE_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_CTRL_S
// Description : Determine whether an address not covered by an active MPU
//               region is Secure (1) or Non-secure (0)
#define DMA_MPU_CTRL_S_RESET  _u(0x0)
#define DMA_MPU_CTRL_S_BITS   _u(0x00000004)
#define DMA_MPU_CTRL_S_MSB    _u(2)
#define DMA_MPU_CTRL_S_LSB    _u(2)
#define DMA_MPU_CTRL_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_CTRL_P
// Description : Determine whether an address not covered by an active MPU
//               region is Privileged (1) or Unprivileged (0)
#define DMA_MPU_CTRL_P_RESET  _u(0x0)
#define DMA_MPU_CTRL_P_BITS   _u(0x00000002)
#define DMA_MPU_CTRL_P_MSB    _u(1)
#define DMA_MPU_CTRL_P_LSB    _u(1)
#define DMA_MPU_CTRL_P_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR0
// Description : Base address register for MPU region 0. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR0_OFFSET _u(0x00000504)
#define DMA_MPU_BAR0_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR0_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR0_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR0_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR0_ADDR_MSB    _u(31)
#define DMA_MPU_BAR0_ADDR_LSB    _u(5)
#define DMA_MPU_BAR0_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR0
// Description : Limit address register for MPU region 0. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR0_OFFSET _u(0x00000508)
#define DMA_MPU_LAR0_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR0_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR0_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR0_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR0_ADDR_MSB    _u(31)
#define DMA_MPU_LAR0_ADDR_LSB    _u(5)
#define DMA_MPU_LAR0_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR0_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR0_S_RESET  _u(0x0)
#define DMA_MPU_LAR0_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR0_S_MSB    _u(2)
#define DMA_MPU_LAR0_S_LSB    _u(2)
#define DMA_MPU_LAR0_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR0_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR0_P_RESET  _u(0x0)
#define DMA_MPU_LAR0_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR0_P_MSB    _u(1)
#define DMA_MPU_LAR0_P_LSB    _u(1)
#define DMA_MPU_LAR0_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR0_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR0_EN_RESET  _u(0x0)
#define DMA_MPU_LAR0_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR0_EN_MSB    _u(0)
#define DMA_MPU_LAR0_EN_LSB    _u(0)
#define DMA_MPU_LAR0_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR1
// Description : Base address register for MPU region 1. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR1_OFFSET _u(0x0000050c)
#define DMA_MPU_BAR1_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR1_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR1_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR1_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR1_ADDR_MSB    _u(31)
#define DMA_MPU_BAR1_ADDR_LSB    _u(5)
#define DMA_MPU_BAR1_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR1
// Description : Limit address register for MPU region 1. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR1_OFFSET _u(0x00000510)
#define DMA_MPU_LAR1_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR1_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR1_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR1_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR1_ADDR_MSB    _u(31)
#define DMA_MPU_LAR1_ADDR_LSB    _u(5)
#define DMA_MPU_LAR1_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR1_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR1_S_RESET  _u(0x0)
#define DMA_MPU_LAR1_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR1_S_MSB    _u(2)
#define DMA_MPU_LAR1_S_LSB    _u(2)
#define DMA_MPU_LAR1_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR1_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR1_P_RESET  _u(0x0)
#define DMA_MPU_LAR1_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR1_P_MSB    _u(1)
#define DMA_MPU_LAR1_P_LSB    _u(1)
#define DMA_MPU_LAR1_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR1_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR1_EN_RESET  _u(0x0)
#define DMA_MPU_LAR1_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR1_EN_MSB    _u(0)
#define DMA_MPU_LAR1_EN_LSB    _u(0)
#define DMA_MPU_LAR1_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR2
// Description : Base address register for MPU region 2. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR2_OFFSET _u(0x00000514)
#define DMA_MPU_BAR2_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR2_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR2_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR2_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR2_ADDR_MSB    _u(31)
#define DMA_MPU_BAR2_ADDR_LSB    _u(5)
#define DMA_MPU_BAR2_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR2
// Description : Limit address register for MPU region 2. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR2_OFFSET _u(0x00000518)
#define DMA_MPU_LAR2_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR2_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR2_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR2_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR2_ADDR_MSB    _u(31)
#define DMA_MPU_LAR2_ADDR_LSB    _u(5)
#define DMA_MPU_LAR2_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR2_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR2_S_RESET  _u(0x0)
#define DMA_MPU_LAR2_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR2_S_MSB    _u(2)
#define DMA_MPU_LAR2_S_LSB    _u(2)
#define DMA_MPU_LAR2_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR2_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR2_P_RESET  _u(0x0)
#define DMA_MPU_LAR2_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR2_P_MSB    _u(1)
#define DMA_MPU_LAR2_P_LSB    _u(1)
#define DMA_MPU_LAR2_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR2_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR2_EN_RESET  _u(0x0)
#define DMA_MPU_LAR2_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR2_EN_MSB    _u(0)
#define DMA_MPU_LAR2_EN_LSB    _u(0)
#define DMA_MPU_LAR2_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR3
// Description : Base address register for MPU region 3. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR3_OFFSET _u(0x0000051c)
#define DMA_MPU_BAR3_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR3_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR3_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR3_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR3_ADDR_MSB    _u(31)
#define DMA_MPU_BAR3_ADDR_LSB    _u(5)
#define DMA_MPU_BAR3_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR3
// Description : Limit address register for MPU region 3. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR3_OFFSET _u(0x00000520)
#define DMA_MPU_LAR3_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR3_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR3_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR3_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR3_ADDR_MSB    _u(31)
#define DMA_MPU_LAR3_ADDR_LSB    _u(5)
#define DMA_MPU_LAR3_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR3_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR3_S_RESET  _u(0x0)
#define DMA_MPU_LAR3_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR3_S_MSB    _u(2)
#define DMA_MPU_LAR3_S_LSB    _u(2)
#define DMA_MPU_LAR3_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR3_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR3_P_RESET  _u(0x0)
#define DMA_MPU_LAR3_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR3_P_MSB    _u(1)
#define DMA_MPU_LAR3_P_LSB    _u(1)
#define DMA_MPU_LAR3_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR3_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR3_EN_RESET  _u(0x0)
#define DMA_MPU_LAR3_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR3_EN_MSB    _u(0)
#define DMA_MPU_LAR3_EN_LSB    _u(0)
#define DMA_MPU_LAR3_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR4
// Description : Base address register for MPU region 4. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR4_OFFSET _u(0x00000524)
#define DMA_MPU_BAR4_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR4_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR4_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR4_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR4_ADDR_MSB    _u(31)
#define DMA_MPU_BAR4_ADDR_LSB    _u(5)
#define DMA_MPU_BAR4_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR4
