Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
// Description : Limit address register for MPU region 4. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR4_OFFSET _u(0x00000528)
#define DMA_MPU_LAR4_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR4_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR4_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR4_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR4_ADDR_MSB    _u(31)
#define DMA_MPU_LAR4_ADDR_LSB    _u(5)
#define DMA_MPU_LAR4_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR4_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR4_S_RESET  _u(0x0)
#define DMA_MPU_LAR4_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR4_S_MSB    _u(2)
#define DMA_MPU_LAR4_S_LSB    _u(2)
#define DMA_MPU_LAR4_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR4_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR4_P_RESET  _u(0x0)
#define DMA_MPU_LAR4_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR4_P_MSB    _u(1)
#define DMA_MPU_LAR4_P_LSB    _u(1)
#define DMA_MPU_LAR4_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR4_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR4_EN_RESET  _u(0x0)
#define DMA_MPU_LAR4_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR4_EN_MSB    _u(0)
#define DMA_MPU_LAR4_EN_LSB    _u(0)
#define DMA_MPU_LAR4_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR5
// Description : Base address register for MPU region 5. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR5_OFFSET _u(0x0000052c)
#define DMA_MPU_BAR5_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR5_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR5_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR5_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR5_ADDR_MSB    _u(31)
#define DMA_MPU_BAR5_ADDR_LSB    _u(5)
#define DMA_MPU_BAR5_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR5
// Description : Limit address register for MPU region 5. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR5_OFFSET _u(0x00000530)
#define DMA_MPU_LAR5_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR5_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR5_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR5_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR5_ADDR_MSB    _u(31)
#define DMA_MPU_LAR5_ADDR_LSB    _u(5)
#define DMA_MPU_LAR5_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR5_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR5_S_RESET  _u(0x0)
#define DMA_MPU_LAR5_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR5_S_MSB    _u(2)
#define DMA_MPU_LAR5_S_LSB    _u(2)
#define DMA_MPU_LAR5_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR5_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR5_P_RESET  _u(0x0)
#define DMA_MPU_LAR5_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR5_P_MSB    _u(1)
#define DMA_MPU_LAR5_P_LSB    _u(1)
#define DMA_MPU_LAR5_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR5_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR5_EN_RESET  _u(0x0)
#define DMA_MPU_LAR5_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR5_EN_MSB    _u(0)
#define DMA_MPU_LAR5_EN_LSB    _u(0)
#define DMA_MPU_LAR5_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR6
// Description : Base address register for MPU region 6. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR6_OFFSET _u(0x00000534)
#define DMA_MPU_BAR6_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR6_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR6_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR6_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR6_ADDR_MSB    _u(31)
#define DMA_MPU_BAR6_ADDR_LSB    _u(5)
#define DMA_MPU_BAR6_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR6
// Description : Limit address register for MPU region 6. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR6_OFFSET _u(0x00000538)
#define DMA_MPU_LAR6_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR6_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR6_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR6_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR6_ADDR_MSB    _u(31)
#define DMA_MPU_LAR6_ADDR_LSB    _u(5)
#define DMA_MPU_LAR6_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR6_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR6_S_RESET  _u(0x0)
#define DMA_MPU_LAR6_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR6_S_MSB    _u(2)
#define DMA_MPU_LAR6_S_LSB    _u(2)
#define DMA_MPU_LAR6_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR6_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR6_P_RESET  _u(0x0)
#define DMA_MPU_LAR6_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR6_P_MSB    _u(1)
#define DMA_MPU_LAR6_P_LSB    _u(1)
#define DMA_MPU_LAR6_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR6_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR6_EN_RESET  _u(0x0)
#define DMA_MPU_LAR6_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR6_EN_MSB    _u(0)
#define DMA_MPU_LAR6_EN_LSB    _u(0)
#define DMA_MPU_LAR6_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_BAR7
// Description : Base address register for MPU region 7. Writable only from a
//               Secure, Privileged context.
#define DMA_MPU_BAR7_OFFSET _u(0x0000053c)
#define DMA_MPU_BAR7_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_BAR7_ADDR
// Description : This MPU region matches addresses where addr[31:5] (the 27 most
//               significant bits) are greater than or equal to BAR_ADDR, and
//               less than or equal to LAR_ADDR.
//
//               Readable from any Privileged context, if and only if this
//               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
//               Otherwise readable only from a Secure, Privileged context.
#define DMA_MPU_BAR7_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_BAR7_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_BAR7_ADDR_MSB    _u(31)
#define DMA_MPU_BAR7_ADDR_LSB    _u(5)
#define DMA_MPU_BAR7_ADDR_ACCESS "RW"
// =============================================================================
// Register    : DMA_MPU_LAR7
// Description : Limit address register for MPU region 7. Writable only from a
//               Secure, Privileged context, with the exception of the P bit.
#define DMA_MPU_LAR7_OFFSET _u(0x00000540)
#define DMA_MPU_LAR7_BITS   _u(0xffffffe7)
#define DMA_MPU_LAR7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR7_ADDR
// Description : Limit address bits 31:5. Readable from any Privileged context,
//               if and only if this region's S bit is clear, and
//               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
//               Secure, Privileged context.
#define DMA_MPU_LAR7_ADDR_RESET  _u(0x0000000)
#define DMA_MPU_LAR7_ADDR_BITS   _u(0xffffffe0)
#define DMA_MPU_LAR7_ADDR_MSB    _u(31)
#define DMA_MPU_LAR7_ADDR_LSB    _u(5)
#define DMA_MPU_LAR7_ADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR7_S
// Description : Determines the Secure/Non-secure (=1/0) status of addresses
//               matching this region, if this region is enabled.
#define DMA_MPU_LAR7_S_RESET  _u(0x0)
#define DMA_MPU_LAR7_S_BITS   _u(0x00000004)
#define DMA_MPU_LAR7_S_MSB    _u(2)
#define DMA_MPU_LAR7_S_LSB    _u(2)
#define DMA_MPU_LAR7_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR7_P
// Description : Determines the Privileged/Unprivileged (=1/0) status of
//               addresses matching this region, if this region is enabled.
//               Writable from any Privileged context, if and only if the S bit
//               is clear. Otherwise, writable only from a Secure, Privileged
//               context.
#define DMA_MPU_LAR7_P_RESET  _u(0x0)
#define DMA_MPU_LAR7_P_BITS   _u(0x00000002)
#define DMA_MPU_LAR7_P_MSB    _u(1)
#define DMA_MPU_LAR7_P_LSB    _u(1)
#define DMA_MPU_LAR7_P_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : DMA_MPU_LAR7_EN
// Description : Region enable. If 1, any address within range specified by the
//               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
//               attributes specified by S and P.
#define DMA_MPU_LAR7_EN_RESET  _u(0x0)
#define DMA_MPU_LAR7_EN_BITS   _u(0x00000001)
#define DMA_MPU_LAR7_EN_MSB    _u(0)
#define DMA_MPU_LAR7_EN_LSB    _u(0)
#define DMA_MPU_LAR7_EN_ACCESS "RW"
// =============================================================================
// Register    : DMA_CH0_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH0_DBG_CTDREQ_OFFSET _u(0x00000800)
#define DMA_CH0_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH0_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH0_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH0_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH0_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH0_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH0_DBG_TCR_OFFSET _u(0x00000804)
#define DMA_CH0_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH0_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH0_DBG_TCR_MSB    _u(31)
#define DMA_CH0_DBG_TCR_LSB    _u(0)
#define DMA_CH0_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH1_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH1_DBG_CTDREQ_OFFSET _u(0x00000840)
#define DMA_CH1_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH1_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH1_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH1_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH1_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH1_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH1_DBG_TCR_OFFSET _u(0x00000844)
#define DMA_CH1_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH1_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH1_DBG_TCR_MSB    _u(31)
#define DMA_CH1_DBG_TCR_LSB    _u(0)
#define DMA_CH1_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH2_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH2_DBG_CTDREQ_OFFSET _u(0x00000880)
#define DMA_CH2_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH2_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH2_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH2_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH2_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH2_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH2_DBG_TCR_OFFSET _u(0x00000884)
#define DMA_CH2_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH2_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH2_DBG_TCR_MSB    _u(31)
#define DMA_CH2_DBG_TCR_LSB    _u(0)
#define DMA_CH2_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH3_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH3_DBG_CTDREQ_OFFSET _u(0x000008c0)
#define DMA_CH3_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH3_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH3_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH3_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH3_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH3_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH3_DBG_TCR_OFFSET _u(0x000008c4)
#define DMA_CH3_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH3_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH3_DBG_TCR_MSB    _u(31)
#define DMA_CH3_DBG_TCR_LSB    _u(0)
#define DMA_CH3_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH4_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH4_DBG_CTDREQ_OFFSET _u(0x00000900)
#define DMA_CH4_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH4_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH4_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH4_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH4_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH4_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH4_DBG_TCR_OFFSET _u(0x00000904)
#define DMA_CH4_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH4_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH4_DBG_TCR_MSB    _u(31)
#define DMA_CH4_DBG_TCR_LSB    _u(0)
#define DMA_CH4_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH5_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH5_DBG_CTDREQ_OFFSET _u(0x00000940)
#define DMA_CH5_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH5_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH5_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH5_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH5_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH5_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH5_DBG_TCR_OFFSET _u(0x00000944)
#define DMA_CH5_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH5_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH5_DBG_TCR_MSB    _u(31)
#define DMA_CH5_DBG_TCR_LSB    _u(0)
#define DMA_CH5_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH6_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH6_DBG_CTDREQ_OFFSET _u(0x00000980)
#define DMA_CH6_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH6_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH6_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH6_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH6_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH6_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH6_DBG_TCR_OFFSET _u(0x00000984)
#define DMA_CH6_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH6_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH6_DBG_TCR_MSB    _u(31)
#define DMA_CH6_DBG_TCR_LSB    _u(0)
#define DMA_CH6_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH7_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH7_DBG_CTDREQ_OFFSET _u(0x000009c0)
#define DMA_CH7_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH7_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH7_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH7_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH7_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH7_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH7_DBG_TCR_OFFSET _u(0x000009c4)
#define DMA_CH7_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH7_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH7_DBG_TCR_MSB    _u(31)
#define DMA_CH7_DBG_TCR_LSB    _u(0)
#define DMA_CH7_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH8_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH8_DBG_CTDREQ_OFFSET _u(0x00000a00)
#define DMA_CH8_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH8_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH8_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH8_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH8_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH8_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH8_DBG_TCR_OFFSET _u(0x00000a04)
#define DMA_CH8_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH8_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH8_DBG_TCR_MSB    _u(31)
#define DMA_CH8_DBG_TCR_LSB    _u(0)
