Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/dma.h
#define DMA_CH8_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH9_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH9_DBG_CTDREQ_OFFSET _u(0x00000a40)
#define DMA_CH9_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH9_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH9_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH9_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH9_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH9_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH9_DBG_TCR_OFFSET _u(0x00000a44)
#define DMA_CH9_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH9_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH9_DBG_TCR_MSB    _u(31)
#define DMA_CH9_DBG_TCR_LSB    _u(0)
#define DMA_CH9_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH10_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH10_DBG_CTDREQ_OFFSET _u(0x00000a80)
#define DMA_CH10_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH10_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH10_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH10_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH10_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH10_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH10_DBG_TCR_OFFSET _u(0x00000a84)
#define DMA_CH10_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH10_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH10_DBG_TCR_MSB    _u(31)
#define DMA_CH10_DBG_TCR_LSB    _u(0)
#define DMA_CH10_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH11_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH11_DBG_CTDREQ_OFFSET _u(0x00000ac0)
#define DMA_CH11_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH11_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH11_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH11_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH11_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH11_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH11_DBG_TCR_OFFSET _u(0x00000ac4)
#define DMA_CH11_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH11_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH11_DBG_TCR_MSB    _u(31)
#define DMA_CH11_DBG_TCR_LSB    _u(0)
#define DMA_CH11_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH12_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH12_DBG_CTDREQ_OFFSET _u(0x00000b00)
#define DMA_CH12_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH12_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH12_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH12_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH12_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH12_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH12_DBG_TCR_OFFSET _u(0x00000b04)
#define DMA_CH12_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH12_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH12_DBG_TCR_MSB    _u(31)
#define DMA_CH12_DBG_TCR_LSB    _u(0)
#define DMA_CH12_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH13_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH13_DBG_CTDREQ_OFFSET _u(0x00000b40)
#define DMA_CH13_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH13_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH13_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH13_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH13_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH13_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH13_DBG_TCR_OFFSET _u(0x00000b44)
#define DMA_CH13_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH13_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH13_DBG_TCR_MSB    _u(31)
#define DMA_CH13_DBG_TCR_LSB    _u(0)
#define DMA_CH13_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH14_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH14_DBG_CTDREQ_OFFSET _u(0x00000b80)
#define DMA_CH14_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH14_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH14_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH14_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH14_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH14_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH14_DBG_TCR_OFFSET _u(0x00000b84)
#define DMA_CH14_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH14_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH14_DBG_TCR_MSB    _u(31)
#define DMA_CH14_DBG_TCR_LSB    _u(0)
#define DMA_CH14_DBG_TCR_ACCESS "RO"
// =============================================================================
// Register    : DMA_CH15_DBG_CTDREQ
// Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
//               expects it can perform on the peripheral without
//               overflow/underflow. Write any value: clears the counter, and
//               cause channel to re-initiate DREQ handshake.
#define DMA_CH15_DBG_CTDREQ_OFFSET _u(0x00000bc0)
#define DMA_CH15_DBG_CTDREQ_BITS   _u(0x0000003f)
#define DMA_CH15_DBG_CTDREQ_RESET  _u(0x00000000)
#define DMA_CH15_DBG_CTDREQ_MSB    _u(5)
#define DMA_CH15_DBG_CTDREQ_LSB    _u(0)
#define DMA_CH15_DBG_CTDREQ_ACCESS "WC"
// =============================================================================
// Register    : DMA_CH15_DBG_TCR
// Description : Read to get channel TRANS_COUNT reload value, i.e. the length
//               of the next transfer
#define DMA_CH15_DBG_TCR_OFFSET _u(0x00000bc4)
#define DMA_CH15_DBG_TCR_BITS   _u(0xffffffff)
#define DMA_CH15_DBG_TCR_RESET  _u(0x00000000)
#define DMA_CH15_DBG_TCR_MSB    _u(31)
#define DMA_CH15_DBG_TCR_LSB    _u(0)
#define DMA_CH15_DBG_TCR_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_DMA_H

